In [1]:
import pandas as pd
import numpy as np

In [4]:
df1 = pd.DataFrame({'first': [1,2,3,4,5],
        'second': [10,20,30,40,50],
        'third': [11,22,33,44,55],})
df1

   first  second  third
0      1      10     11
1      2      20     22
2      3      30     33
3      4      40     44
4      5      50     55

In [6]:
df1['first']

0    1
1    2
2    3
3    4
4    5
Name: first, dtype: int64

In [8]:
df1[['first']]

   first
0      1
1      2
2      3
3      4
4      5

In [10]:
import seaborn as sns
tipsdata = sns.load_dataset('tips')
tipsdata.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

# Groupby()

In [11]:
tipsdata.groupby(['sex'])['tip'].mean()

sex
Male      3.089618
Female    2.833448
Name: tip, dtype: float64

In [12]:
tipsdata.groupby(['smoker'])['tip'].mean()

smoker
Yes    3.008710
No     2.991854
Name: tip, dtype: float64

In [15]:
tipsdata.groupby(['smoker'])['tip'].agg(np.mean) #np.std

smoker
Yes    3.008710
No     2.991854
Name: tip, dtype: float64

In [17]:
tipsdata.groupby(['smoker','sex'])['tip','total_bill'].agg(np.mean)

                    tip  total_bill
smoker sex
Yes    Male    3.051167   22.284500
       Female  2.931515   17.977879
No     Male    3.113402   19.791237
       Female  2.773519   18.105185

In [19]:
tipsdata.groupby(['smoker','sex'])['tip','total_bill'].agg(np.mean).reset_index()

  smoker     sex       tip  total_bill
0    Yes    Male  3.051167   22.284500
1    Yes  Female  2.931515   17.977879
2     No    Male  3.113402   19.791237
3     No  Female  2.773519   18.105185

# Filtering

In [21]:
tipsdata.loc[(tipsdata['smoker']=='No')&(tipsdata.total_bill >= 10)].head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

# melt + groupby

In [33]:
# First, lets set the dataset
bb = pd.read_csv('billboard.csv',encoding = 'unicode_escape')
bb = bb.rename({'artist.inverted':'artist'}, axis=1)
bb.drop(['time','date.entered','date.peaked'], axis=1, inplace=True)

new_names = np.arange(1,77,1)
old_names = bb.iloc[:,4:].columns   # bb.iloc[:,4:80]
bb.rename(columns=dict(zip(old_names, new_names)), inplace=True)

bb.head()

,year,artist,track,genre,1,2,3,4,5,6,...,67,68,69,70,71,72,73,74,75,76
0,2000,Destiny's Child,Independent Women Part I,Rock,78,63.0,49.0,33.0,23.0,15.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2000,Santana,"Maria, Maria",Rock,15,8.0,6.0,5.0,2.0,3.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2000,Savage Garden,I Knew I Loved You,Rock,71,48.0,43.0,31.0,20.0,13.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2000,Madonna,Music,Rock,41,23.0,18.0,14.0,2.0,1.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2000,"Aguilera, Christina",Come On Over Baby (All I Want Is You),Rock,57,47.0,45.0,29.0,23.0,18.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Following 4 cells below are example for:
### + .melt()
### + .groupby()
### with a slight differences in coding, try these commneted parts and explore different typing styles

In [36]:
#bb.melt(id_vars=['year','artist','track','genre'], var_name= 'weeks', value_name='ratings').groupby('artist')['ratings'].max()

In [45]:
#(bb
# .melt(id_vars=['year','artist','track','genre'], var_name= 'weeks', value_name='ratings')
# .groupby('artist')['ratings']
# .min())

In [49]:
#(bb
# .melt(id_vars=bb.iloc[:,:4], var_name= 'weeks', value_name='ratings')
# .groupby('artist')['ratings']
# .min())

In [52]:
#bb\
# .melt(id_vars=['year','artist','track','genre'],
#       var_name= 'weeks',
#       value_name='ratings')\
# .groupby('artist')['ratings']\
# .min()

# Example: .melt() + .split()

In [61]:
df2 = pd.read_csv('data2.csv', sep=';')
df2 = df2.melt(id_vars=['day'], value_name='counts')
df2.sample(8)

     day       variable  counts
230   35   Death_London       9
270   26  Death_NewYork      79
53     5   Cases_London      59
35    36   Cases_Berlin      30
168   22   Death_Berlin      64
33    34   Cases_Berlin      25
156   10   Death_Berlin      53
213   18   Death_London      24

In [62]:
df2[['Status','City']]=df2['variable'].str.split('_', expand=True)
df2.drop(['variable'], axis=1, inplace=True)
df2.sample(8)

     day  counts Status     City
0      1       8  Cases   Berlin
109   12      42  Cases  NewYork
194   48      15  Death   Berlin
141   44      20  Cases  NewYork
3      4      95  Cases   Berlin
153    7      65  Death   Berlin
9     10      17  Cases   Berlin
72    24      83  Cases   London

In [64]:
df1 = pd.DataFrame({'first': [1,2,3,4,5],
        'second': ['10/100','20/230','30/453','40/322','50/546']
        })
df1

   first  second
0      1  10/100
1      2  20/230
2      3  30/453
3      4  40/322
4      5  50/546

In [72]:
df1['second'].str.split('/').str.get(1)

0    100
1    230
2    453
3    322
4    546
Name: second, dtype: object

### Another typo

In [95]:
# df1[['n','n2']]=df1['second'].str.split('/', expand=True)
# Instead of this (above), this can be done also that way

df1['new']=df1['second'].str.split('/').str.get(0)
df1['new2']=df1['second'].str.split('/').str.get(1)
df1

   first  second new new2
0      1  10/100  10  100
1      2  20/230  20  230
2      3  30/453  30  453
3      4  40/322  40  322
4      5  50/546  50  546

In [96]:
df1.dtypes

first      int64
second    object
new       object
new2      object
dtype: object

In [97]:
df1.new = df1.new.astype(int)
df1.new2 = df1.new2.astype(int)
df1.dtypes

first      int64
second    object
new        int32
new2       int32
dtype: object